---
kind: method
id: M:Autodesk.Revit.UI.Macros.UIMacroManager.EditMacro(Autodesk.Revit.DB.Macros.Macro)
source: html/59543c37-27b2-8359-ef1d-fa6d72c70c6f.htm
---
# Autodesk.Revit.UI.Macros.UIMacroManager.EditMacro Method

Edits the macro in sharp develop.

## Syntax (C#)
```csharp
public void EditMacro(
	Macro macro
)
```

## Parameters
- **macro** (`Autodesk.Revit.DB.Macros.Macro`) - The macro.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null